MikroElektronika/core_packages/PIC/XC8/def/PIC18F85J50/mcu.h
#define                                 CS1_bit             _BIT_ACCESS(PMADDRH,6)
// PMCONL<CS1P>
extern volatile __bit                   CS1P                __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 CS1P_bit            _BIT_ACCESS(PMCONL,3)
// PMADDRH<CS2>
extern volatile __bit                   CS2                 __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 CS2_bit             _BIT_ACCESS(PMADDRH,7)
// PMCONL<CS2P>
extern volatile __bit                   CS2P                __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 CS2P_bit            _BIT_ACCESS(PMCONL,4)
// PMCONL<CSF0>
extern volatile __bit                   CSF0                __at(0x7A56);	// @ (0xF4A * 8 + 6)
#define                                 CSF0_bit            _BIT_ACCESS(PMCONL,6)
// PMCONL<CSF1>
extern volatile __bit                   CSF1                __at(0x7A57);	// @ (0xF4A * 8 + 7)
#define                                 CSF1_bit            _BIT_ACCESS(PMCONL,7)
// TXSTA1<CSRC>
extern volatile __bit _DEPRECATED       CSRC                __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA1,7)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// PORTF<CVREF>
extern volatile __bit                   CVREF               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 CVREF_bit           _BIT_ACCESS(PORTF,5)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCON,6)
// CVRCON<CVROEN>
extern volatile __bit                   CVROEN              __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 CVROEN_bit          _BIT_ACCESS(CVRCON,6)
// CVRCON<CVRR>
extern volatile __bit                   CVRR                __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 CVRR_bit            _BIT_ACCESS(CVRCON,5)
// CVRCON<CVRSS>
extern volatile __bit                   CVRSS               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 CVRSS_bit           _BIT_ACCESS(CVRCON,4)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// ECCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(ECCP1CON,4)
// ECCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(ECCP1CON,5)
// ECCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(ECCP2CON,4)
// ECCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(ECCP2CON,5)
// ECCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x7D8C);	// @ (0xFB1 * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(ECCP3CON,4)
// ECCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x7D8D);	// @ (0xFB1 * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(ECCP3CON,5)
// CCP4CON<DC4B0>
extern volatile __bit                   DC4B0               __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 DC4B0_bit           _BIT_ACCESS(CCP4CON,4)
// CCP4CON<DC4B1>
extern volatile __bit                   DC4B1               __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DC4B1_bit           _BIT_ACCESS(CCP4CON,5)
// CCP4CON<DC4X>
extern volatile __bit                   DC4X                __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DC4X_bit            _BIT_ACCESS(CCP4CON,5)
// CCP4CON<DC4Y>
extern volatile __bit                   DC4Y                __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 DC4Y_bit            _BIT_ACCESS(CCP4CON,4)
// CCP5CON<DC5B0>
extern volatile __bit                   DC5B0               __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 DC5B0_bit           _BIT_ACCESS(CCP5CON,4)
// CCP5CON<DC5B1>
extern volatile __bit                   DC5B1               __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 DC5B1_bit           _BIT_ACCESS(CCP5CON,5)
// CCP5CON<DC5X>
extern volatile __bit                   DC5X                __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 DC5X_bit            _BIT_ACCESS(CCP5CON,5)
// CCP5CON<DC5Y>
extern volatile __bit                   DC5Y                __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 DC5Y_bit            _BIT_ACCESS(CCP5CON,4)
// CCP4CON<DCCP4X>
extern volatile __bit                   DCCP4X              __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DCCP4X_bit          _BIT_ACCESS(CCP4CON,5)
// CCP4CON<DCCP4Y>
extern volatile __bit                   DCCP4Y              __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 DCCP4Y_bit          _BIT_ACCESS(CCP4CON,4)
// CCP5CON<DCCP5X>
extern volatile __bit                   DCCP5X              __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 DCCP5X_bit          _BIT_ACCESS(CCP5CON,5)
// CCP5CON<DCCP5Y>
extern volatile __bit                   DCCP5Y              __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 DCCP5Y_bit          _BIT_ACCESS(CCP5CON,4)
// WDTCON<DEVCFG>
extern volatile __bit                   DEVCFG              __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 DEVCFG_bit          _BIT_ACCESS(WDTCON,4)
// UEIE<DFN8EE>
extern volatile __bit                   DFN8EE              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 DFN8EE_bit          _BIT_ACCESS(UEIE,3)
// UEIR<DFN8EF>
extern volatile __bit                   DFN8EF              __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 DFN8EF_bit          _BIT_ACCESS(UEIR,3)
// USTAT<DIR>
extern volatile __bit                   DIR                 __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 DIR_bit             _BIT_ACCESS(USTAT,2)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// PORTC<DT>
extern volatile __bit                   DT                  __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT_bit              _BIT_ACCESS(PORTC,7)
// PORTG<DT2>
extern volatile __bit                   DT2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 DT2_bit             _BIT_ACCESS(PORTG,2)
// BAUDCON1<DTRXP>
extern volatile __bit _DEPRECATED       DTRXP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 DTRXP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<DTRXP1>
extern volatile __bit                   DTRXP1              __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 DTRXP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<DTRXP2>
extern volatile __bit                   DTRXP2              __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 DTRXP2_bit          _BIT_ACCESS(BAUDCON2,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<D_NOT_A2>
extern volatile __bit                   D_NOT_A2            __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 D_NOT_A2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// MEMCON<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(MEMCON,7)
// ECCP1AS<ECCP1AS0>
extern volatile __bit                   ECCP1AS0            __at(0x7DFC);	// @ (0xFBF * 8 + 4)
#define                                 ECCP1AS0_bit        _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCP1AS1>
extern volatile __bit                   ECCP1AS1            __at(0x7DFD);	// @ (0xFBF * 8 + 5)
#define                                 ECCP1AS1_bit        _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCP1AS2>
extern volatile __bit                   ECCP1AS2            __at(0x7DFE);	// @ (0xFBF * 8 + 6)
#define                                 ECCP1AS2_bit        _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCP1ASE>
extern volatile __bit                   ECCP1ASE            __at(0x7DFF);	// @ (0xFBF * 8 + 7)
#define                                 ECCP1ASE_bit        _BIT_ACCESS(ECCP1AS,7)
// ODCON1<ECCP1OD>
extern volatile __bit                   ECCP1OD             __at(0x7E78);	// @ (0xFCF * 8 + 0)
#define                                 ECCP1OD_bit         _BIT_ACCESS(ODCON1,0)
// ECCP2AS<ECCP2AS0>
extern volatile __bit                   ECCP2AS0            __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 ECCP2AS0_bit        _BIT_ACCESS(ECCP2AS,4)
// ECCP2AS<ECCP2AS1>
extern volatile __bit                   ECCP2AS1            __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 ECCP2AS1_bit        _BIT_ACCESS(ECCP2AS,5)
// ECCP2AS<ECCP2AS2>
extern volatile __bit                   ECCP2AS2            __at(0x7DD6);	// @ (0xFBA * 8 + 6)
#define                                 ECCP2AS2_bit        _BIT_ACCESS(ECCP2AS,6)
// ECCP2AS<ECCP2ASE>
extern volatile __bit                   ECCP2ASE            __at(0x7DD7);	// @ (0xFBA * 8 + 7)
#define                                 ECCP2ASE_bit        _BIT_ACCESS(ECCP2AS,7)
// ODCON1<ECCP2OD>
extern volatile __bit                   ECCP2OD             __at(0x7E79);	// @ (0xFCF * 8 + 1)
#define                                 ECCP2OD_bit         _BIT_ACCESS(ODCON1,1)
// ECCP3AS<ECCP3AS0>
extern volatile __bit                   ECCP3AS0            __at(0x7DAC);	// @ (0xFB5 * 8 + 4)
#define                                 ECCP3AS0_bit        _BIT_ACCESS(ECCP3AS,4)
// ECCP3AS<ECCP3AS1>
extern volatile __bit                   ECCP3AS1            __at(0x7DAD);	// @ (0xFB5 * 8 + 5)
#define                                 ECCP3AS1_bit        _BIT_ACCESS(ECCP3AS,5)
// ECCP3AS<ECCP3AS2>
extern volatile __bit                   ECCP3AS2            __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 ECCP3AS2_bit        _BIT_ACCESS(ECCP3AS,6)
// ECCP3AS<ECCP3ASE>
extern volatile __bit                   ECCP3ASE            __at(0x7DAF);	// @ (0xFB5 * 8 + 7)
#define                                 ECCP3ASE_bit        _BIT_ACCESS(ECCP3AS,7)
// ODCON1<ECCP3OD>
extern volatile __bit                   ECCP3OD             __at(0x7E7A);	// @ (0xFCF * 8 + 2)
#define                                 ECCP3OD_bit         _BIT_ACCESS(ODCON1,2)
// MEMCON<EDBIS>
extern volatile __bit                   EDBIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EDBIS_bit           _BIT_ACCESS(MEMCON,7)
// USTAT<ENDP0>
extern volatile __bit                   ENDP0               __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 ENDP0_bit           _BIT_ACCESS(USTAT,3)
// USTAT<ENDP1>
extern volatile __bit                   ENDP1               __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 ENDP1_bit           _BIT_ACCESS(USTAT,4)
// USTAT<ENDP2>
extern volatile __bit                   ENDP2               __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 ENDP2_bit           _BIT_ACCESS(USTAT,5)
// USTAT<ENDP3>
extern volatile __bit                   ENDP3               __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 ENDP3_bit           _BIT_ACCESS(USTAT,6)
// UEP0<EP0CONDIS>
extern volatile __bit                   EP0CONDIS           __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 EP0CONDIS_bit       _BIT_ACCESS(UEP0,3)
// UEP0<EP0HSHK>
extern volatile __bit                   EP0HSHK             __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 EP0HSHK_bit         _BIT_ACCESS(UEP0,4)
// UEP0<EP0INEN>
extern volatile __bit                   EP0INEN             __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 EP0INEN_bit         _BIT_ACCESS(UEP0,1)
// UEP0<EP0OUTEN>
extern volatile __bit                   EP0OUTEN            __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 EP0OUTEN_bit        _BIT_ACCESS(UEP0,2)
// UEP0<EP0STALL>
extern volatile __bit                   EP0STALL            __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 EP0STALL_bit        _BIT_ACCESS(UEP0,0)
// UEP1<EP1CONDIS>
extern volatile __bit                   EP1CONDIS           __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 EP1CONDIS_bit       _BIT_ACCESS(UEP1,3)
// UEP1<EP1HSHK>
extern volatile __bit                   EP1HSHK             __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 EP1HSHK_bit         _BIT_ACCESS(UEP1,4)
// UEP1<EP1INEN>
extern volatile __bit                   EP1INEN             __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 EP1INEN_bit         _BIT_ACCESS(UEP1,1)
// UEP1<EP1OUTEN>
extern volatile __bit                   EP1OUTEN            __at(0x7A6A);	// @ (0xF4D * 8 + 2)
#define                                 EP1OUTEN_bit        _BIT_ACCESS(UEP1,2)
// UEP1<EP1STALL>
extern volatile __bit                   EP1STALL            __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 EP1STALL_bit        _BIT_ACCESS(UEP1,0)
// UEP2<EP2CONDIS>
extern volatile __bit                   EP2CONDIS           __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 EP2CONDIS_bit       _BIT_ACCESS(UEP2,3)
// UEP2<EP2HSHK>
extern volatile __bit                   EP2HSHK             __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 EP2HSHK_bit         _BIT_ACCESS(UEP2,4)
// UEP2<EP2INEN>
extern volatile __bit                   EP2INEN             __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 EP2INEN_bit         _BIT_ACCESS(UEP2,1)
// UEP2<EP2OUTEN>
extern volatile __bit                   EP2OUTEN            __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 EP2OUTEN_bit        _BIT_ACCESS(UEP2,2)
// UEP2<EP2STALL>
extern volatile __bit                   EP2STALL            __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 EP2STALL_bit        _BIT_ACCESS(UEP2,0)
// UEP3<EP3CONDIS>
extern volatile __bit                   EP3CONDIS           __at(0x7A7B);	// @ (0xF4F * 8 + 3)
#define                                 EP3CONDIS_bit       _BIT_ACCESS(UEP3,3)
// UEP3<EP3HSHK>
extern volatile __bit                   EP3HSHK             __at(0x7A7C);	// @ (0xF4F * 8 + 4)
#define                                 EP3HSHK_bit         _BIT_ACCESS(UEP3,4)
// UEP3<EP3INEN>
extern volatile __bit                   EP3INEN             __at(0x7A79);	// @ (0xF4F * 8 + 1)
#define                                 EP3INEN_bit         _BIT_ACCESS(UEP3,1)
// UEP3<EP3OUTEN>
extern volatile __bit                   EP3OUTEN            __at(0x7A7A);	// @ (0xF4F * 8 + 2)
#define                                 EP3OUTEN_bit        _BIT_ACCESS(UEP3,2)
// UEP3<EP3STALL>
extern volatile __bit                   EP3STALL            __at(0x7A78);	// @ (0xF4F * 8 + 0)
#define                                 EP3STALL_bit        _BIT_ACCESS(UEP3,0)
// UEP4<EP4CONDIS>
extern volatile __bit                   EP4CONDIS           __at(0x7A83);	// @ (0xF50 * 8 + 3)
#define                                 EP4CONDIS_bit       _BIT_ACCESS(UEP4,3)
// UEP4<EP4HSHK>
extern volatile __bit                   EP4HSHK             __at(0x7A84);	// @ (0xF50 * 8 + 4)
#define                                 EP4HSHK_bit         _BIT_ACCESS(UEP4,4)
// UEP4<EP4INEN>
extern volatile __bit                   EP4INEN             __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 EP4INEN_bit         _BIT_ACCESS(UEP4,1)
// UEP4<EP4OUTEN>
extern volatile __bit                   EP4OUTEN            __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 EP4OUTEN_bit        _BIT_ACCESS(UEP4,2)
// UEP4<EP4STALL>
extern volatile __bit                   EP4STALL            __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 EP4STALL_bit        _BIT_ACCESS(UEP4,0)
// UEP5<EP5CONDIS>
extern volatile __bit                   EP5CONDIS           __at(0x7A8B);	// @ (0xF51 * 8 + 3)
#define                                 EP5CONDIS_bit       _BIT_ACCESS(UEP5,3)
// UEP5<EP5HSHK>
extern volatile __bit                   EP5HSHK             __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 EP5HSHK_bit         _BIT_ACCESS(UEP5,4)
// UEP5<EP5INEN>
extern volatile __bit                   EP5INEN             __at(0x7A89);	// @ (0xF51 * 8 + 1)
#define                                 EP5INEN_bit         _BIT_ACCESS(UEP5,1)
// UEP5<EP5OUTEN>
extern volatile __bit                   EP5OUTEN            __at(0x7A8A);	// @ (0xF51 * 8 + 2)
#define                                 EP5OUTEN_bit        _BIT_ACCESS(UEP5,2)
// UEP5<EP5STALL>
extern volatile __bit                   EP5STALL            __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 EP5STALL_bit        _BIT_ACCESS(UEP5,0)
// UEP6<EP6CONDIS>
extern volatile __bit                   EP6CONDIS           __at(0x7A93);	// @ (0xF52 * 8 + 3)
#define                                 EP6CONDIS_bit       _BIT_ACCESS(UEP6,3)
// UEP6<EP6HSHK>
extern volatile __bit                   EP6HSHK             __at(0x7A94);	// @ (0xF52 * 8 + 4)
#define                                 EP6HSHK_bit         _BIT_ACCESS(UEP6,4)
// UEP6<EP6INEN>
extern volatile __bit                   EP6INEN             __at(0x7A91);	// @ (0xF52 * 8 + 1)
#define                                 EP6INEN_bit         _BIT_ACCESS(UEP6,1)
// UEP6<EP6OUTEN>
extern volatile __bit                   EP6OUTEN            __at(0x7A92);	// @ (0xF52 * 8 + 2)
#define                                 EP6OUTEN_bit        _BIT_ACCESS(UEP6,2)
// UEP6<EP6STALL>
extern volatile __bit                   EP6STALL            __at(0x7A90);	// @ (0xF52 * 8 + 0)
#define                                 EP6STALL_bit        _BIT_ACCESS(UEP6,0)
// UEP7<EP7CONDIS>
extern volatile __bit                   EP7CONDIS           __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 EP7CONDIS_bit       _BIT_ACCESS(UEP7,3)
// UEP7<EP7HSHK>
extern volatile __bit                   EP7HSHK             __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 EP7HSHK_bit         _BIT_ACCESS(UEP7,4)
// UEP7<EP7INEN>
extern volatile __bit                   EP7INEN             __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 EP7INEN_bit         _BIT_ACCESS(UEP7,1)
// UEP7<EP7OUTEN>
extern volatile __bit                   EP7OUTEN            __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 EP7OUTEN_bit        _BIT_ACCESS(UEP7,2)
// UEP7<EP7STALL>
extern volatile __bit                   EP7STALL            __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 EP7STALL_bit        _BIT_ACCESS(UEP7,0)
// UEP0<EPCONDIS0>
extern volatile __bit                   EPCONDIS0           __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 EPCONDIS0_bit       _BIT_ACCESS(UEP0,3)
// UEP1<EPCONDIS1>
extern volatile __bit                   EPCONDIS1           __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 EPCONDIS1_bit       _BIT_ACCESS(UEP1,3)
// UEP10<EPCONDIS10>
extern volatile __bit                   EPCONDIS10          __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 EPCONDIS10_bit      _BIT_ACCESS(UEP10,3)
// UEP11<EPCONDIS11>
extern volatile __bit                   EPCONDIS11          __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 EPCONDIS11_bit      _BIT_ACCESS(UEP11,3)
// UEP12<EPCONDIS12>
extern volatile __bit                   EPCONDIS12          __at(0x7AC3);	// @ (0xF58 * 8 + 3)
#define                                 EPCONDIS12_bit      _BIT_ACCESS(UEP12,3)
// UEP13<EPCONDIS13>
extern volatile __bit                   EPCONDIS13          __at(0x7ACB);	// @ (0xF59 * 8 + 3)
#define                                 EPCONDIS13_bit      _BIT_ACCESS(UEP13,3)
// UEP14<EPCONDIS14>
extern volatile __bit                   EPCONDIS14          __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 EPCONDIS14_bit      _BIT_ACCESS(UEP14,3)
// UEP15<EPCONDIS15>
extern volatile __bit                   EPCONDIS15          __at(0x7ADB);	// @ (0xF5B * 8 + 3)
